Revit 2027 API
Outline.MaximumPoint Property
 The maximum point of the bounding box.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ MaximumPoint { get; set; }
Public Property MaximumPoint As XYZ
	Get
	Set
public:
property XYZ^ MaximumPoint {
	XYZ^ get ();
	void set (XYZ^ value);
}
member MaximumPoint : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Outline Class
Autodesk.Revit.DB Namespace